# 当前时间:2021/9/14 19:58
s='hello,python'
s1=s[:5]
s2=s[6:]
s3="!"
new_str=s1+s3+s2
print(id(s))
print(id(s1))
print(id(s2))
print(id(s3))
print(id(new_str))

'''--------------------切片----------------------------'''
print(s[0:5:1])
print(s[::2])
print(s[::-1])
print(s[-1:-7:-1])


'''------------------格式化字符串-------------------'''
# %s 字符串
# %i或%d 整数
# %f 浮点数
# {}占位符
name='tom'
age=20
print('你好，我是%s,今年%d' % (name,age))
print('你好，我是{0},今年{1}'.format(name,age))
print(f'你好，我是{name},今年{age}')

print('%10d' % 99)   # 总宽度为10
print('%.3f' % 3.1415926272829)  # 最大保留3位
print('%10.3f' % 3.1415926272829)  # 同时保留宽度和精度
print('{0:.3}'.format(3.1415926))  # 保留3位数字，不是保留3位小数
print('{0:.3f}'.format(3.1415926))  # 保留3位小数
print('{0:10.3f}'.format(3.1415926))  # 保留宽度同时保留3位小数







